examples/cylinder2D_openfoam/fluid-openfoam-cylinder2D-R100/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  com                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    "(cylinder_wall|top|bottom)"
    {
        type noSlip;
    }
    
    jet1
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    jet2
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
